<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# <center> Проект: Анализ вакансий из HeadHunter

In [155]:
import pandas as pd
import psycopg2

In [156]:
# вставьте сюда параметры подключения из юнита 1. Работа с базой данных из Python

In [157]:
connection = psycopg2.connect(
    dbname='project_sql',
    user='skillfactory',
    host='84.201.134.129',
    password='cCkxxLVrDE8EbvjueeMedPKt',
    port='5432'
)

# Юнит 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

In [158]:
# текст запроса
query_3_1 = f'''select 
            COUNT(*)
            from public.Vacancies
                
'''

In [159]:
df = pd.read_sql_query(query_3_1 , connection)
df

/opt/anaconda3/lib/python3.9/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   count
0  49197

2. Напишите запрос, который посчитает количество работодателей (таблица employers).

In [160]:
# текст запроса
query_3_2 = f'''select 
            COUNT(*)
            from public.EMPLOYERS
                
'''

In [161]:
df = pd.read_sql_query(query_3_2 , connection)
df

/opt/anaconda3/lib/python3.9/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   count
0  23501

3. Посчитате с помощью запроса количество регионов (таблица areas).

In [162]:
# текст запроса
query_3_3 = f'''select 
            COUNT(*)
            from public.AREAS
                
'''

In [163]:
df = pd.read_sql_query(query_3_3 , connection)
df

/opt/anaconda3/lib/python3.9/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   count
0   1362

4. Посчитате с помощью запроса количество сфер деятельности в базе (таблица industries).

In [164]:
# текст запроса
query_3_4 = f'''select 
            COUNT(*)
            from public.INDUSTRIES
                
'''

In [165]:
df = pd.read_sql_query(query_3_4 , connection)
df

/opt/anaconda3/lib/python3.9/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   count
0    294

***

Предворительный анализ произведен, ознакомились с колличеством данных.

# Юнит 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Отсортируйте по количеству вакансий в порядке убывания.

In [166]:
query_4_1 = f'''SELECT
        a.name,
        COUNT(v.name) cnt
        FROM public.vacancies v
        JOIN public.areas a ON a.id = v.area_id 
        GROUP BY a.name
        ORDER BY 2 DESC 
                
'''

In [167]:
df = pd.read_sql_query(query_4_1 , connection)
df# результат запроса

/opt/anaconda3/lib/python3.9/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

                name   cnt
0             Москва  5333
1    Санкт-Петербург  2851
2              Минск  2112
3        Новосибирск  2006
4             Алматы  1892
..               ...   ...
764       Тарко-Сале     1
765    Новоаннинский     1
766            Бирск     1
767           Сасово     1
768             Анна     1

[769 rows x 2 columns]

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [168]:
query_4_2 = f'''SELECT
COUNT(*)
FROM public.vacancies v
join public.areas a ON a.id = v.area_id 
WHERE salary_from > 0 OR salary_to > 0 
                
'''

In [169]:
df = pd.read_sql_query(query_4_2 , connection)
df# результат запроса

/opt/anaconda3/lib/python3.9/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   count
0  24073

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого.

In [170]:
query_4_3 = f'''SELECT

ROUND(AVG(salary_from)),
ROUND(AVG(salary_to))
FROM public.vacancies v
join public.areas a ON a.id = v.area_id                 
'''

In [171]:
df = pd.read_sql_query(query_4_3 , connection)
df# результат запроса

/opt/anaconda3/lib/python3.9/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

     round     round
0  71065.0  110537.0

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [172]:
query_4_4 = f'''SELECT
employment,
schedule,
COUNT(schedule)
FROM public.vacancies
group by employment,schedule
ORDER BY 3 desc            
'''

In [173]:
df = pd.read_sql_query(query_4_4 , connection)
df# результат запроса

/opt/anaconda3/lib/python3.9/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

             employment          schedule  count
0      Полная занятость       Полный день  35367
1      Полная занятость  Удаленная работа   7802
2      Полная занятость     Гибкий график   1593
3   Частичная занятость  Удаленная работа   1312
4      Полная занятость    Сменный график    940
5            Стажировка       Полный день    569
6      Полная занятость    Вахтовый метод    367
7   Частичная занятость       Полный день    347
8   Частичная занятость     Гибкий график    312
9      Проектная работа       Полный день    141
10     Проектная работа  Удаленная работа    133
11           Стажировка     Гибкий график    116
12  Частичная занятость    Сменный график    101
13           Стажировка  Удаленная работа     64
14     Проектная работа     Гибкий график     18
15           Стажировка    Сменный график     12
16     Проектная работа    Вахтовый метод      2
17     Проектная работа    Сменный график      1

5. Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [174]:
query_4_5 = f'''SELECT
experience,
count(experience)
FROM public.vacancies
GROUP BY 1
order BY 2        
'''

In [175]:
df = pd.read_sql_query(query_4_5 , connection)
df# результат запроса

/opt/anaconda3/lib/python3.9/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

           experience  count
0         Более 6 лет   1337
1           Нет опыта   7197
2       От 3 до 6 лет  14511
3  От 1 года до 3 лет  26152

***

Все запросы по детальному анализу выполнены, необходимая информация получена.

# Юнит 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [176]:
query_5_1 = f'''SELECT
e.name,
COUNT(v.name)
FROM public.vacancies v 
JOIN employers e ON e.id = v.employer_id
group by e.name
ORDER BY 2 desc   
'''

In [177]:
df = pd.read_sql_query(query_5_1 , connection)
df# результат запроса

/opt/anaconda3/lib/python3.9/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

                         name  count
0                      Яндекс   1933
1                  Ростелеком    491
2                    Тинькофф    444
3                        СБЕР    428
4               Газпром нефть    331
...                       ...    ...
14761            им. Тьюринга      1
14762        LLC Novalab Tech      1
14763   Компания Мир упаковки      1
14764  Лифинцев Олег Иванович      1
14765      ТрансЭнергоХолдинг      1

[14766 rows x 2 columns]

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [178]:
query_5_2 = f'''
SELECT
    a.name area,
    count(e.id) cnt_e,
    count(v.id) cnt_v
FROM public.areas a
LEFT JOIN public.vacancies v ON v.area_id = a.id
LEFT JOIN public.employers e ON e.area = a.id
where v.id is null
GROUP BY a.id
ORDER BY 2 DESC
'''

In [179]:
df = pd.read_sql_query(query_5_2 , connection)
df# результат запроса

/opt/anaconda3/lib/python3.9/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

                   area  cnt_e  cnt_v
0                Россия    410      0
1             Казахстан    207      0
2    Московская область     75      0
3    Краснодарский край     19      0
4    Ростовская область     18      0
..                  ...    ...    ...
588             Скидель      0      0
589          Белоозерск      0      0
590           Орловский      0      0
591          Павловская      0      0
592             Таксимо      0      0

[593 rows x 3 columns]

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [180]:
query_5_3 = f'''
select
e.name,
count(distinct(v.area_id))
FROM employers e
JOIN  vacancies v ON v.employer_id  = e.id 
GROUP BY e.name
ORDER BY 2 desc
'''

In [181]:
df = pd.read_sql_query(query_5_3 , connection)
df

/opt/anaconda3/lib/python3.9/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

                         name  count
0                      Яндекс    181
1                  Ростелеком    152
2                  Спецремонт    116
3      Поляков Денис Иванович     88
4                   ООО ЕФИН      71
...                       ...    ...
14761                  UniSol      1
14762            UNISTORY LLC      1
14763                   UNIT6      1
14764     United Distribution      1
14765              UNITEL LLC      1

[14766 rows x 2 columns]

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [182]:
query_5_4 = f'''SELECT  
COUNT(e.id)
FROM employers_industries ei
RIGHT JOIN employers e ON ei.employer_id  = e.id
WHERE ei.employer_id is null
'''

In [183]:
df = pd.read_sql_query(query_5_4 , connection)
df

/opt/anaconda3/lib/python3.9/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   count
0   8419

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [184]:
query_5_5 = f'''SELECT distinct
e.name,
COUNT(i.name)
FROM employers_industries ei
RIGHT JOIN employers e ON ei.employer_id  = e.id
JOIN industries i ON i.id = industry_id
GROUP BY e.name
HAVING COUNT(i.name) = 4
Order by 1
'''

In [185]:
df = pd.read_sql_query(query_5_5 , connection)
df

/opt/anaconda3/lib/python3.9/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

                 name  count
0        101 Интернет      4
1            21vek.by      4
2                2ГИС      4
3                  2К      4
4         4 пикселя +      4
...               ...    ...
1131            ЮРИОН      4
1132  ЮТИП Технологии      4
1133           ЯКласс      4
1134            ЯрНео      4
1135    Яшин&Партнёры      4

[1136 rows x 2 columns]

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [186]:
query_5_6 = f'''SELECT 
COUNT(i.name)
FROM employers_industries ei
RIGHT JOIN employers e ON ei.employer_id  = e.id
JOIN industries i ON i.id = industry_id
WHERE i.name like 'Разработка программного обеспечения'
'''

In [187]:
df = pd.read_sql_query(query_5_6 , connection)
df

/opt/anaconda3/lib/python3.9/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   count
0   3553

7. Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

Список городов-милионников надо взять [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8). 

Если возникнут трудности с этим задание посмотрите материалы модуля  PYTHON-17. Как получать данные из веб-источников и API.

In [188]:
url = 'https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8'
tables = pd.read_html(url, encoding='utf-8')
city = tables[1]['Город']
city = city.to_frame()
print((list(city['Город'])),end = " ")

['Москва', 'Санкт-Петербург', 'Новосибирск', 'Екатеринбург', 'Казань', 'Нижний Новгород', 'Челябинск', 'Красноярск', 'Самара', 'Уфа', 'Ростов-на-Дону', 'Омск', 'Краснодар', 'Воронеж[a]', 'Пермь', 'Волгоград']

In [189]:
query_5_7 = f'''SELECT 
a.name,
COUNT(v.name) cnt
FROM employers e
JOIN vacancies v ON e.id = v.employer_id
JOIN areas a ON a.id = v.area_id
WHERE e.name like 'Яндекс'
AND a.name in ('Москва', 'Санкт-Петербург', 'Новосибирск', 'Екатеринбург', 'Казань', 'Нижний Новгород', 'Челябинск', 'Красноярск', 'Самара', 'Уфа', 'Ростов-на-Дону', 'Омск', 'Краснодар', 'Воронеж', 'Пермь', 'Волгоград') 
GROUP BY 1

UNION ALL

SELECT
'Total',
COUNT(*)
FROM employers e
JOIN vacancies v ON e.id = v.employer_id
JOIN areas a ON a.id = v.area_id
WHERE e.name like 'Яндекс'
AND a.name in ('Москва', 'Санкт-Петербург', 'Новосибирск', 'Екатеринбург', 'Казань', 'Нижний Новгород', 'Челябинск', 'Красноярск', 'Самара', 'Уфа', 'Ростов-на-Дону', 'Омск', 'Краснодар', 'Воронеж', 'Пермь', 'Волгоград') 
ORDER BY cnt
'''

In [190]:
df = pd.read_sql_query(query_5_7 , connection)
print(df)

print('len =', len(df))

               name  cnt
0              Омск   21
1         Челябинск   22
2        Красноярск   23
3         Волгоград   24
4             Пермь   25
5            Казань   25
6    Ростов-на-Дону   25
7               Уфа   26
8            Самара   26
9         Краснодар   30
10          Воронеж   32
11      Новосибирск   35
12  Нижний Новгород   36
13     Екатеринбург   39
14  Санкт-Петербург   42
15           Москва   54
16            Total  485
len = 17

/opt/anaconda3/lib/python3.9/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

***

Выполнил анализ работодателей, с поступившей информацией ознакомился.

# Юнит 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

*Подсказка: Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [191]:
query_6_1 = f'''SELECT 
COUNT(name)
FROM vacancies
WHERE name ILIKE '%DATA%' OR name ILIKE '%данн%'
'''

In [192]:
df = pd.read_sql_query(query_6_1 , connection)
df

/opt/anaconda3/lib/python3.9/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   count
0   1771

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? 
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'

** В следующих заданиях мы продолжим работать с вакансиями по этому условию.*

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [193]:
query_6_2 = f'''SELECT COUNT(*)
FROM vacancies
WHERE ((name ILIKE '%data scientist%') 
OR (name ILIKE '%data science%') 
OR (name ILIKE '%исследователь данных%') 
OR ((name LIKE '%ML%') AND (name NOT ILIKE '%HTML%'))
OR (name ILIKE '%machine learning%') 
OR  (name ILIKE '%машинн%обучен%'))
AND  ((name ILIKE '%junior%') OR (experience = 'Нет опыта') OR (employment = 'Стажировка'))
'''

In [194]:
df = pd.read_sql_query(query_6_2 , connection)
df

/opt/anaconda3/lib/python3.9/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   count
0     51

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

** Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [195]:
query_6_3 = f'''
SELECT 
COUNT(*)
FROM vacancies
WHERE ((name ILIKE '%data scientist%') 
OR (name ILIKE '%data science%') 
OR (name ILIKE '%исследователь данных%') 
OR ((name LIKE '%ML%') AND (name NOT ILIKE '%HTML%'))
OR (name ILIKE '%machine learning%') 
OR  (name ILIKE '%машинн%обучен%'))
AND (key_skills ILIKE '%SQL%' OR key_skills ILIKE '%postgres%')
'''

In [196]:
df = pd.read_sql_query(query_6_3 , connection)
df

/opt/anaconda3/lib/python3.9/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   count
0    201

4. Проверьте, насколько популярен Python в требованиях работодателей к DS.Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

** Это можно сделать помощью запроса, аналогичного предыдущему.*

In [197]:
query_6_4 = f'''
SELECT 
COUNT(*)
FROM vacancies
WHERE ((name ILIKE '%data scientist%') 
OR (name ILIKE '%data science%') 
OR (name ILIKE '%исследователь данных%') 
OR ((name LIKE '%ML%') AND (name NOT ILIKE '%HTML%'))
OR (name ILIKE '%machine learning%') 
OR  (name ILIKE '%машинн%обучен%'))
AND (key_skills ILIKE '%python%')
'''

In [198]:
df = pd.read_sql_query(query_6_4 , connection)
df

/opt/anaconda3/lib/python3.9/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   count
0    351

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до двух знаков после точки-разделителя.

In [199]:
query_6_5 = f'''
select
avg(round((length(key_skills)-
length(replace(key_skills,CHR(9),''))+1),2))
FROM vacancies
WHERE ((name ILIKE '%data scientist%') 
OR (name ILIKE '%data science%') 
OR (name ILIKE '%исследователь данных%') 
OR ((name LIKE '%ML%') AND (name NOT ILIKE '%HTML%'))
OR (name ILIKE '%machine learning%') 
OR  (name ILIKE '%машинн%обучен%'))
AND (key_skills is not null)
'''

In [200]:
df = pd.read_sql_query(query_6_5 , connection)
df

/opt/anaconda3/lib/python3.9/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

        avg
0  6.406032

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*). 

При решении задачи примите во внимание следующее:
1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [201]:
query_6_6 = f'''
SELECT
experience,
ROUND(AVG(coalesce((salary_from+salary_to)/2, salary_from, salary_to)),0)
FROM vacancies
WHERE ((name ILIKE '%data scientist%') 
OR (name ILIKE '%data science%') 
OR (name ILIKE '%исследователь данных%') 
OR ((name LIKE '%ML%') AND (name NOT ILIKE '%HTML%'))
OR (name ILIKE '%machine learning%') 
OR  (name ILIKE '%машинн%обучен%'))
AND (salary_from IS NOT NULL or salary_to IS NOT NULL)
GROUP BY 1
'''

In [202]:
df = pd.read_sql_query(query_6_6 , connection)
df

/opt/anaconda3/lib/python3.9/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

           experience     round
0           Нет опыта   74643.0
1  От 1 года до 3 лет  139675.0
2       От 3 до 6 лет  243115.0

***

Исходя из полученных данных, мы можем сказать, что даже для junior-позиции нужны не маленькие знания для того, чтобы получить вакансию в данной сфере. Необходимо примерно 6 ключевых навыков. Заработная плата на данной позиции не высокая, и всего лишь 51 вакансия на данный момент открыта.

# Общий вывод по проекту

Произвели анализ вакансий, ответили на интересующие вопросы.

## Доп. Иследования

7.1 Напишем запрос по количеству открытых вакансий по сферам деятельности

In [203]:
query_7_1 = f'''
select i.name, COUNT(*)
from Vacancies v 
JOIN employers e ON e.id = v.employer_id
JOIN employers_industries ei ON ei.employer_id = e.id
JOIN industries i ON ei.industry_id = i.id
GROUP BY 1
ORDER BY 2 desc
'''
df = pd.read_sql_query(query_7_1 , connection)
df

/opt/anaconda3/lib/python3.9/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

                                                  name  count
0                  Разработка программного обеспечения  12499
1    Системная интеграция,  автоматизации технологи...  11034
2    Интернет-компания (поисковики, платежные систе...   6413
3                                                 Банк   2742
4                                      Мобильная связь   1585
..                                                 ...    ...
288                               Спортивная федерация      5
289                                          Химчистка      4
290             Ассоциация в сфере культуры, искусства      2
291                                          Автошкола      1
292                                  Ритуальные услуги      1

[293 rows x 2 columns]

С уверенностью могу сказать, что хороший IT специалист без работы не останется !

7.2 Найдем, какаие сферы деятельности ,связанные с данными, встречаются чаше всего?

In [204]:
query_7_2 = f'''select i.name, COUNT(*)
from Vacancies v 
JOIN employers e ON e.id = v.employer_id
JOIN employers_industries ei ON ei.employer_id = e.id
JOIN industries i ON ei.industry_id = i.id
JOIN areas a ON v.area_id = a.id
WHERE ((v.name ILIKE '%data scientist%') 
OR (v.name ILIKE '%data science%') 
OR (v.name ILIKE '%исследователь данных%') 
OR ((v.name LIKE '%ML%') AND (v.name NOT ILIKE '%HTML%'))
OR (v.name ILIKE '%machine learning%') 
OR  (v.name ILIKE '%машинн%обучен%'))
GROUP BY 1
ORDER BY 2 desc
'''
df = pd.read_sql_query(query_7_2 , connection)
df

/opt/anaconda3/lib/python3.9/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

                                                 name  count
0                 Разработка программного обеспечения    148
1   Системная интеграция,  автоматизации технологи...    139
2                                                Банк     92
3   Интернет-компания (поисковики, платежные систе...     79
4                                     Мобильная связь     23
..                                                ...    ...
92                                 Центры развлечения      1
93  Производство и ремонт военной техники, оборудо...      1
94  Продукция черной металлургии (продвижение, опт...      1
95   Производство печатной, полиграфической продукции      1
96  Промышленное, бытовое электрооборудование и эл...      1

[97 rows x 2 columns]

Расмотрим ТОП востребованных сфер деятельности в каждом из регионов.

In [205]:

query_7_3 = f'''select 
a.name, i.name, COUNT(i.name) cnt
from Vacancies v 
JOIN employers e ON e.id = v.employer_id
JOIN employers_industries ei ON ei.employer_id = e.id
JOIN industries i ON ei.industry_id = i.id
JOIN areas a ON v.area_id = a.id
WHERE a.name in ('Москва', 'Санкт-Петербург', 'Новосибирск', 'Екатеринбург', 'Казань', 'Нижний Новгород', 'Челябинск', 'Красноярск', 'Самара', 'Уфа', 'Ростов-на-Дону', 'Омск', 'Краснодар', 'Воронеж[a]', 'Пермь', 'Волгоград')
GROUP BY 1,2
ORDER BY 3 desc
'''
df = pd.read_sql_query(query_7_3 , connection)
df

/opt/anaconda3/lib/python3.9/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

                 name                                               name   cnt
0              Москва                Разработка программного обеспечения  1294
1              Москва  Системная интеграция,  автоматизации технологи...  1117
2     Санкт-Петербург                Разработка программного обеспечения   908
3              Москва  Интернет-компания (поисковики, платежные систе...   798
4     Санкт-Петербург  Системная интеграция,  автоматизации технологи...   679
...               ...                                                ...   ...
2832           Казань                  Органическая химия (производство)     1
2833  Нижний Новгород                      Благотворительная организация     1
2834        Волгоград             Управление и эксплуатация недвижимости     1
2835  Нижний Новгород                        Обучение иностранным языкам     1
2836        Челябинск  Драгоценные, благородные и редкие металлы (про...     1

[2837 rows x 3 columns]